Revit 2024 API
DWGImportOptions Methods
The DWGImportOptions type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from BaseImportOptions.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDefaultLengthUnit
 Get the default length unit used for importing unitless files.
 (Inherited from BaseImportOptions.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLayerSelection
 Get all set layers name which user want to import into Revit.
 (Inherited from BaseImportOptions.)
GetLineWeights
 Gets array of line weights.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetDefaultLengthUnit
 Set the default length unit used for importing unitless files.
 (Inherited from BaseImportOptions.)
SetLayerSelection
 Set the layers name which user want to import into Revit.
 (Inherited from BaseImportOptions.)
SetLineWeights
 Set array of line weights.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DWGImportOptions Class
Autodesk.Revit.DB Namespace